{
  "navbar": {
    "home": "Inicio",
    "about": "Acerca de m칤",
    "projects": "Proyectos",
    "resume": "Curr칤culum",
    "customize": "Personalizar"
  },
  "home": {
    "greeting": "춰Hola!",
    "wave": "游녦游낕",
    "introduction": "SOY",
    "name": "RAMIRO TOULEMONDE",
    "roles": {
      "developer": "Desarrollador Frontend",
      "passionate": "Apasionado por la Tecnolog칤a"
    },
    "aboutMe": "ACERCA DE M칈",
    "letMeIntroduce": "D칠jame presentarme",
    "interests": "Tecnolog칤as Web y Productos",
    "description4": "Siempre que es posible, tambi칠n aplico mi pasi칩n por desarrollar productos con",
    "frameworks": "Node.js y Bibliotecas y Frameworks Modernos de Javascript",
    "react": "como React.js",
    "findMe": "ENCU칄NTRAME EN",
    "feelFree": "No dudes en",
    "connect": "conectar",
    "withMe": "conmigo",
    "home2": {
      "letMeIntroduce": "D칄JAME PRESENTARME",
      "experience": "He estado desarrollando aplicaciones web por m치s de 5 a침os, especializ치ndome exclusivamente en desarrollo Frontend.",
      "technologies": "Tengo amplia experiencia trabajando con tecnolog칤as como React.js y React Native, la mayor parte del tiempo usando TypeScript como lenguaje de programaci칩n principal.",
      "techHighlight1": " React.js ",
      "techConnector1": " y ",
      "techHighlight2": " React Native, ",
      "techConnector2": "la mayor parte del tiempo usando ",
      "techHighlight3": "TypeScript ",
      "techConnector3": "como lenguaje de programaci칩n principal.",
      "personality": "Me considero un profesional proactivo con excelentes habilidades blandas, siempre dispuesto a aprender y listo para asumir nuevos desaf칤os. Mi pasi칩n radica en crear interfaces limpias, escalables y f치ciles de usar, ofreciendo grandes experiencias de usuario mientras mejoro constantemente mis habilidades t칠cnicas.",
      "passion": "Siempre que es posible, tambi칠n aplico mi pasi칩n por desarrollar productos con ",
      "nextjs": "Next.js ",
      "learning": " (Aprendiendo) "
    }
  },
  "about": {
    "title": "Conoce qui칠n",
    "highlight": "SOY",
    "description1": "Hola a todos, soy",
    "name": "Ramiro Santiago Toulemonde",
    "location": "de Santa Rosa, La Pampa, ARGENTINA.",
    "description2": "Me gradu칠 como Analista de Sistemas en 2012.",
    "description3": "He estado trabajando en el sector privado de TI durante 3 a침os y medio desde 2022 hasta la actualidad. Antes de esto, adquir칤 6 a침os de experiencia en el campo de TI dentro de una organizaci칩n gubernamental, donde di mis primeros pasos en el desarrollo frontend.",
    "description4": "Actualmente trabajo como desarrollador de software en Temperies.",
    "activities": "Adem치s de programar, 춰hay otras actividades que me encanta hacer!",
    "activity1": "Tocar Instrumentos (Piano y Guitarra)",
    "activity2": "Restaurar autos antiguos",
    "activity3": "Viajar con mi familia",
    "quote": "\"Mi frase favorita es: '춰Lo 칰nico imposible es lo que no intentas!'\"",
    "skillset": "Conjunto de Habilidades",
    "skillsetHighlight": "Profesionales",
    "tools": "Herramientas",
    "toolsHighlight": "que uso",
    "languages": "Idiomas",
    "languagesHighlight": "que hablo",
    "daysCode": "D칤as que",
    "daysCodeHighlight": "Programo",
    "languageSkills": {
      "spanish": "Espa침ol",
      "english": "Ingl칠s",
      "native": "NATIVO",
      "upperIntermediate": "B2 INTERMEDIO SUPERIOR"
    }
  },
  "projects": {
    "title": "Mis",
    "highlight": "Trabajos Recientes",
    "description": "Aqu칤 hay algunos proyectos en los que he trabajado recientemente.",
    "github": "GitHub",
    "demo": "Demo",
    "underConstruction": "En Construcci칩n",
    "ramInformatica": {
      "title": "RAM Inform치tica",
      "description": "Ram Inform치tica es una plataforma de e-commerce desarrollada con React.js, enfocada en brindar una experiencia de compra fluida y moderna para productos tecnol칩gicos. Una de las caracter칤sticas clave de este proyecto es su sistema de automatizaci칩n, construido con Python, que procesa autom치ticamente las actualizaciones diarias de precios. El sistema lee las listas de productos recibidas a trav칠s de un newsletter de WhatsApp, extrae y formatea los datos, y luego sube los precios actualizados directamente a la plataforma. Esta integraci칩n asegura que los clientes siempre tengan acceso a la informaci칩n m치s reciente de stock y precios, mientras reduce significativamente la carga manual de actualizar los cat치logos de productos."
    },
    "tablaPeriodicsa": {
      "title": "Tabla Peri칩dica",
      "description": "La Aplicaci칩n de Tabla Peri칩dica es una aplicaci칩n web interactiva que permite a los usuarios explorar todos los elementos qu칤micos en una interfaz moderna y f치cil de usar. El proyecto incluye una caracter칤stica de modo oscuro y claro, mejorando la usabilidad y accesibilidad para diferentes preferencias de visualizaci칩n. Los usuarios pueden navegar por los elementos con detalles clave como n칰mero at칩mico, s칤mbolo, masa y categor칤a, mientras disfrutan de un dise침o responsivo optimizado para dispositivos de escritorio y m칩viles. Con un dise침o limpio y cambio suave de temas, la Aplicaci칩n de Tabla Peri칩dica proporciona tanto valor educativo como una experiencia de usuario atractiva."
    },
    "clickFragancias": {
      "title": "Clickfragancias",
      "description": "ClickFragancias es una plataforma de e-commerce especializada en la venta de perfumes, cosm칠ticos y productos de belleza. El sitio web est치 dise침ado para proporcionar a los clientes una experiencia de compra suave y agradable, con una interfaz intuitiva, cat치logo de productos organizado y proceso de pago seguro. La plataforma se enfoca en ofrecer una amplia variedad de fragancias y esenciales de belleza, facilitando a los usuarios navegar por categor칤as, marcas y rangos de precios. Con un dise침o moderno y responsivo, ClickFragancias asegura accesibilidad en todos los dispositivos, mientras construye confianza y conveniencia para clientes que buscan comprar en l칤nea."
    },
    "carsale": {
      "title": "Carsale",
      "description": "Carsale es una plataforma de gesti칩n dise침ada para concesionarios de autom칩viles para simplificar y optimizar sus operaciones diarias. El sistema proporciona herramientas para gestionar el inventario de veh칤culos, mantener un seguimiento del stock en tiempo real y agilizar los procesos de ventas. Una de sus caracter칤sticas clave es la capacidad de generar y publicar autom치ticamente publicaciones en Instagram, mostrando veh칤culos disponibles con sus detalles como modelo, precio y caracter칤sticas. Esta automatizaci칩n no solo ahorra tiempo sino que tambi칠n mejora la presencia en l칤nea y la estrategia de marketing del concesionario. Al combinar la gesti칩n de stock con la integraci칩n de redes sociales, Carsale ofrece a los concesionarios una forma eficiente de controlar el inventario, llegar a clientes potenciales y mejorar el rendimiento de ventas a trav칠s de canales digitales."
    },
    "alkila": {
      "title": "Alkila",
      "description": "Alkila es una plataforma web dise침ada para hacer m치s accesibles los alquileres de propiedades para las personas de mi ciudad. La aplicaci칩n permite a los usuarios buscar y explorar alquileres disponibles con filtros personalizables, como rango de precios, n칰mero de habitaciones, tipo de propiedad y m치s. El objetivo de Alkila es simplificar el proceso de encontrar un hogar ofreciendo una interfaz intuitiva, opciones de b칰squeda inteligentes y listados en tiempo real. Con un enfoque en la usabilidad y el rendimiento, la plataforma proporciona una soluci칩n moderna para conectar propietarios y inquilinos, haciendo el mercado inmobiliario local m치s transparente y eficiente."
    }
  },
  "resume": {
    "downloadCV": "Descargar CV",
    "loading": "Cargando PDF...",
    "error": "Error al cargar el PDF",
    "reload": "Recargar p치gina",
    "cvTitle": "Curriculum Vitae",
    "viewPdf": "Ver CV en PDF",
    "cvDescription": "Haz clic en el bot칩n de abajo para ver o descargar mi CV en formato PDF"
  },
  "customize": {
    "title": "Personalizar",
    "highlight": "Tema",
    "description": "Elige tu tema de color favorito para el portfolio",
    "currentTheme": "Tema Actual",
    "selectTheme": "Seleccionar Tema",
    "customizeDescription": "Personaliza la apariencia del portfolio eligiendo tu paleta de colores favorita entre",
    "availableOptions": "8 opciones disponibles",
    "optionsDetail": ": P칰rpura (original), Verde, Azul, Naranja, Rosa, Amarillo, Rojo y Cian. Los cambios se aplicar치n inmediatamente y se guardar치n para tu pr칩xima visita.",
    "colorPalettes": "Paletas de Colores",
    "selectFavorite": "Selecciona tu combinaci칩n de colores favorita:",
    "active": "Activo",
    "tip": "Consejo:",
    "tipDescription": "Cada tema incluye su propio logo personalizado que se adapta autom치ticamente."
  },
  "footer": {
    "designed": "Dise침ado y Desarrollado por",
    "copyright": "Copyright 춸",
    "rights": "Ramiro Toulemonde"
  }
}